# System.
brew 'zsh'                        # Shell.
brew 'git'                        # Vcs.
brew 'git-flow-avh'               # Git-flow support.
brew 'tmux'                       # Temrinal multiplexer.
brew 'reattach-to-user-namespace' # Allow for pbcopy/pbpaste in tmux.
brew 'binutils'                   # Gold, nm, objdump.
brew 'most'                       # Nicer pager than less.
brew 'htop-osx'                   # Process viewer.
brew 'jq'                         # JSON parsing from shell.
brew 'mobile-shell'               # Mosh, better ssh.
brew 'watch'                      # Shell util to watch a command.
brew 'tree'                       # Nice tool to dump diectory tree.
brew 'wget'                       # Alternative to curl.
brew 'siege'                      # HTTP benchmark tool.
brew 'wrk'                        # HTTP benchmark tool.

brew 'coreutils'                  # Gdate & co.
brew 'asciinema'                  # Terminal recorder.
brew 'unrar'                      # Unrar tool.
brew 'xz'                         # Compression tool.
brew 'nmap'                       # Network scans.

# 3rd part services.
#brew 'terraform'       # Infrastructure from files.
#brew 'awscli'          # Amazon AWS.
#brew 'docker-cloud'    # Docker-cloud (formerly tutum).
#brew 'rancher-cli'     # Rancher.
#brew 'rancher-compose' # Rancher.

# Editor.
brew 'emacs'
brew 'ispell'

# Golang.
brew 'go'
brew 'glide' # Vendor manager.

# Other languages/vms.
#brew 'node'
#brew 'python'

# Docker.
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'


# Fonts.
tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-awesome-terminal-fonts'


# Dependencies. (Optional, for `brew bundle cleanup`)
brew 'autoconf'
brew 'pcre'
brew 'gdbm'
brew 'libyaml'
brew 'readline'
brew 'openssl'
brew 'libevent'
brew 'protobuf'
brew 's-lang'
brew 'sqlite'
brew 'gmp'
brew 'isl'
brew 'pango'
brew 'librsvg'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pixman'
brew 'glib'
brew 'cairo'
brew 'jpeg'
brew 'libtiff'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'libcroco'
brew 'icu4c'
brew 'harfbuzz'
brew 'oniguruma'
brew 'libmpc'
brew 'mpfr'
